## Pandas - Python Data Analysis Library

Pandas is used to analyze data. Pandas is a python library providing fast, flexible and expressive data structures designed to make working with relational or labelled data both easy and intuitive. It aims to be the fundermental high-level building block for doing real world data analysis in python.

- Series - 1 Dimension 
- DataFrame - 2 Dimension

Creating a Series
- Use a list
- Use a Dictionary
- Usind a Numpy Array

In [1]:
# Import Pandas
import pandas as pd

In [2]:
# Create a series using a list - pd.series(data=??, index=??)
age = [12,14,14,23,56,66]
age

[12, 14, 14, 23, 56, 66]

In [3]:
customer = pd.Series(data=age)
customer

0    12
1    14
2    14
3    23
4    56
5    66
dtype: int64

In [6]:
name = ['Saka', 'John', 'Henry', 'Elizabeth', 'Sarah', 'Mary']
customer = pd.Series(data=age, index=name)
customer

Saka         12
John         14
Henry        14
Elizabeth    23
Sarah        56
Mary         66
dtype: int64

In [13]:
# Creating a series using a distionary
movies = {"Avatar":2022,"Black Panther":2020,"Saw":2010,"Avenger":2020,"IronMan":2021,"Hulk":2004}
movies

{'Avatar': 2022,
 'Black Panther': 2020,
 'Saw': 2010,
 'Avenger': 2020,
 'IronMan': 2021,
 'Hulk': 2004}

In [14]:
film = pd.Series(movies)
film

Avatar           2022
Black Panther    2020
Saw              2010
Avenger          2020
IronMan          2021
Hulk             2004
dtype: int64

In [16]:
film.index

Index(['Avatar', 'Black Panther', 'Saw', 'Avenger', 'IronMan', 'Hulk'], dtype='object')

In [17]:
film.values

array([2022, 2020, 2010, 2020, 2021, 2004], dtype=int64)

In [18]:
#filtering to movies in 2020
film >= 2020

Avatar            True
Black Panther     True
Saw              False
Avenger           True
IronMan           True
Hulk             False
dtype: bool

In [21]:
film[film >= 2020]

Avatar           2022
Black Panther    2020
Avenger          2020
IronMan          2021
dtype: int64

In [22]:
film[film < 2020]

Saw     2010
Hulk    2004
dtype: int64

In [26]:
# the year iron man was made
film['Avatar']

2022

### DataFrame

In [34]:
# Create a dataframe using list
# customer Revenue
header = ['name', 'age', 'quantity', 'revenue']
df = [['Ben', 23, 250, 2500],['Kerry', 21, 30, 45900],['Micheal', 24, 100, 1500],['Nene', 24, 90, 1700],['James', 27, 800, 3000]]

In [35]:
# pd.DataFrame(data=??, index=??, Columns=??)
cust_rev= pd.DataFrame(data=df, columns=header)
cust_rev

      name  age  quantity  revenue
0      Ben   23       250     2500
1    Kerry   21        30    45900
2  Micheal   24       100     1500
3     Nene   24        90     1700
4    James   27       800     3000

In [36]:
# indexing and filtering
# age > 25

cust_rev['age']>25

0    False
1    False
2    False
3    False
4     True
Name: age, dtype: bool

In [37]:
cust_rev[cust_rev['age']>25]

    name  age  quantity  revenue
4  James   27       800     3000

In [38]:
cust_rev['revenue']<3000

0     True
1    False
2     True
3     True
4    False
Name: revenue, dtype: bool

In [40]:
cust_rev[cust_rev['revenue']<3000]

      name  age  quantity  revenue
0      Ben   23       250     2500
2  Micheal   24       100     1500
3     Nene   24        90     1700

In [42]:
type(cust_rev[['name']])

pandas.core.frame.DataFrame

In [43]:
cust_rev[['name','revenue']][cust_rev['revenue']<3000]

      name  revenue
0      Ben     2500
2  Micheal     1500
3     Nene     1700

In [46]:
## creating a new column
cust_rev['rev/qty'] = round(cust_rev['revenue']/cust_rev['quantity'], 2)
cust_rev

      name  age  quantity  revenue  rev/qty
0      Ben   23       250     2500    10.00
1    Kerry   21        30    45900  1530.00
2  Micheal   24       100     1500    15.00
3     Nene   24        90     1700    18.89
4    James   27       800     3000     3.75

In [48]:
cust_rev[['name', 'age','rev/qty']][cust_rev['quantity']> 100]

    name  age  rev/qty
0    Ben   23    10.00
4  James   27     3.75

In [49]:
pwd()

'C:\\Users\\value'